import React from 'react'

import { style } from './Style'

import { Container } from '@components/Container'

import sign from '@images/about/sign.png'

export const Profile: React.FC = () => {
  return (
    <div className={style.profile} data-layout="Profile">
      <section className={style.profileContainer}>
        <div className={style.profileTitles}>
          <h2>
            <ruby>
              在之邨雲阿須速理<rt>アリノムラクモアスハヤリ</rt>
            </ruby>
          </h2>
          <ul className={style.profileSnsItems}>
            <li>
              <a
                href="https://github.com/arinomurakumo"
                target="_blank"
                rel="noopener noreferrer"
                className={style.profileSnsLink}
              >
                <svg
                  width="32"
                  height="32"
                  viewBox="0 0 32 32"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  aria-label="github link"
                >
                  <g clipPath="url(#clip0_379_687)">
                    <path
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M16.29 0C7.29 0 0 7.29 0 16.29C0 23.49 4.67 29.59 11.14 31.75C11.95 31.9 12.25 31.4 12.25 30.96C12.25 30.57 12.24 29.55 12.23 28.19C7.7 29.17 6.74 26.01 6.74 26.01C6 24.13 4.93 23.63 4.93 23.63C3.45 22.62 5.04 22.64 5.04 22.64C6.67 22.76 7.54 24.32 7.54 24.32C8.99 26.81 11.35 26.09 12.28 25.67C12.43 24.62 12.85 23.9 13.31 23.49C9.69 23.08 5.89 21.68 5.89 15.44C5.89 13.66 6.52 12.21 7.57 11.07C7.4 10.66 6.84 9 7.73 6.76C7.73 6.76 9.1 6.32 12.21 8.43C13.51 8.07 14.9 7.89 16.29 7.88C17.67 7.88 19.07 8.07 20.37 8.43C23.48 6.32 24.85 6.76 24.85 6.76C25.74 9 25.18 10.66 25.01 11.07C26.05 12.21 26.68 13.66 26.68 15.44C26.68 21.7 22.87 23.07 19.24 23.48C19.82 23.98 20.35 24.98 20.35 26.5C20.35 28.68 20.33 30.43 20.33 30.97C20.33 31.41 20.62 31.91 21.45 31.75C27.92 29.59 32.58 23.49 32.58 16.3C32.58 7.29 25.29 0 16.29 0Z"
                      fill="white"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_379_687">
                      <rect width="32" height="32" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </a>
            </li>
            <li>
              <a
                href="https://note.com/arinomurakumo"
                target="_blank"
                rel="noopener noreferrer"
                className={style.profileSnsLink}
              >
                <svg
                  width="32"
                  height="32"
                  viewBox="0 0 32 32"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M32 16C32 24.8366 24.8366 32 16 32C7.16344 32 0 24.8366 0 16C0 7.16344 7.16344 0 16 0C24.8366 0 32 7.16344 32 16Z"
                    fill="white"
                  />
                  <path
                    d="M7.00083 14.3853C6.12973 14.3614 4.91018 14.4092 4.02455 14.4092V18.887H5.2925V15.5C5.2925 15.5 6.42009 15.4617 6.82661 15.5096C7.20893 15.5526 7.34927 15.787 7.36379 16.275C7.37347 16.8299 7.36379 17.1217 7.36379 18.887H8.63174C8.63174 18.887 8.64626 16.8682 8.63174 16.165C8.61238 14.9163 8.17199 14.414 7.00083 14.3853Z"
                    fill="black"
                  />
                  <path
                    d="M12.8662 14.371C11.6128 14.371 10.5916 15.3852 10.5916 16.6338C10.5916 17.8824 11.6128 18.8966 12.8662 18.8966C14.1196 18.8966 15.1407 17.8824 15.1407 16.6338C15.1407 15.3852 14.1196 14.371 12.8662 14.371ZM12.8662 17.8154C12.208 17.8154 11.6757 17.2844 11.6757 16.629C11.6757 15.9736 12.208 15.4426 12.8662 15.4426C13.5244 15.4426 14.0567 15.9736 14.0567 16.629C14.0567 17.2892 13.5244 17.8154 12.8662 17.8154Z"
                    fill="black"
                  />
                  <path
                    d="M27.1234 16.6338C27.1234 15.3852 26.1022 14.371 24.8488 14.371C23.5954 14.371 22.5743 15.3852 22.5743 16.6338C22.5743 17.3657 22.913 17.9924 23.4405 18.4086C23.8083 18.6957 24.3213 18.8966 25.0085 18.8966C25.3425 18.8966 26.2087 18.8057 26.833 18.1216L26.32 17.4423C26.1022 17.6336 25.5554 17.9015 25.1198 17.9015C24.5681 17.9015 24.2342 17.7963 23.9922 17.5714C23.8422 17.4375 23.7357 17.2318 23.6873 16.9782H27.0895C27.1089 16.8634 27.1234 16.7534 27.1234 16.6338ZM23.697 16.2224C23.8229 15.6913 24.2003 15.2991 24.844 15.2991C25.5167 15.2991 25.87 15.7201 25.9861 16.2224H23.697Z"
                    fill="black"
                  />
                  <path
                    d="M19.4479 13.9548H18.2622V15.213H17.0426V16.3133H18.2622V17.6193H19.4479V16.3133H20.6674V15.213H19.4479V13.9548Z"
                    fill="black"
                  />
                </svg>
              </a>
            </li>
          </ul>
        </div>
        <section className={style.profileContents}>
          <h3>祭人</h3>
          <p>在之邨雲阿須速理（アリノムラクモアスハヤリ）と申します。</p>
          <p>
            Web 屋としてのキャリアは 2013 年 Web デザイナーから始まりました。
            <br />
            現在は事業会社に所属し、
            <br />
            主たる業務は、デザイナ組織でフロントエンド開発を、リードデザイナとして職責しています。
          </p>
        </section>
        <section className={style.profileContents}>
          <h3>徳</h3>
          <ul>
            <li>
              フロントエンド開発に関するコーディング
              <ul>
                <li>HTML / CSS設計、React およびビューに関わるテスト</li>
              </ul>
            </li>
            <li>Web での UI 作成</li>
          </ul>
        </section>
        <section className={style.profileContents}>
          <h3>由緒</h3>
          <p>
            2013 年以前は定職につかず音楽制作を行う。
            <br />
            何者にもなれず友人であるメンターに教えを乞う。
          </p>
          <ul>
            <li>
              2013
              <ul>
                <li>
                  はじまりは、契約社員の任期満了後の雇用保険を頼りに、3ヶ月 HTML
                  / CSS を独学。
                  <br />
                  マッチングサイトのアルバイトとして、Web
                  デザイナーとしてのキャリアをスタート。
                  <br />
                  この頃デザインとアートを混合する。
                </li>
              </ul>
            </li>
            <li>
              2014
              <ul>
                <li>
                  フリーランスとして独立。Wordpress を主業務にクラウドワーク。
                  <br />
                  支払いがないクライアントと技術不足で疲弊する。
                </li>
              </ul>
            </li>
            <li>
              2014 - 2019
              <ul>
                <li>
                  制作会社へ初就職。寝る以外だいたい仕事と Web に没頭。
                  <br />
                  努力するという意味を 齢 30 を過ぎて知る。
                </li>
              </ul>
            </li>
            <li>
              2020
              <ul>
                <li>事業会社へ転職。組織を学ぶ。既存事業開発に従事。</li>
              </ul>
            </li>
            <li>
              2021
              <ul>
                <li>
                  子会社間異動。新規事業開発に従事。職位シニアデザイナ。
                  <br />
                  視野を広げるため社外でスタートアップを手伝う。
                </li>
              </ul>
            </li>
            <li>
              2022 -
              <ul>
                <li>子会社合併で異動。職位リードデザイナ。</li>
              </ul>
            </li>
          </ul>
        </section>
        <section className={style.profileContents}>
          <h3>紋</h3>
          <p>
            祭人が奉斎を行う上で頭文字「在」の篆書を設計に取り込んだ事が由緒になります。
          </p>
          <img
            src={sign}
            alt="在印"
            width={96}
            height={96}
            className={style.buttonImage}
          />
        </section>
      </section>
    </div>
  )
}
